work/interface_conf/PRODCT_SQL/CR2018000019-JANGTAI_APP/INTERFACE_XML/江泰-境外旅游意外险-基本款-个人-方案一-报文样例.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:ser="http://service.interf.sinosoft.com/">
   <soapenv:Header/>
   <soapenv:Body>
      <ser:proposalPrepare>
         <CommonAccidentProposalInfo>
            <agentCode>M00000000008</agentCode>
        <businessNature>k</businessNature>
        <classCode>27</classCode>
        <startDate>2018-04-26T00:00:00</startDate>
        <endDate>2018-04-26T23:59:59</endDate>
        <operateDate>2018-04-23T15:05:30</operateDate>
        <orderId>JTJN00000000000056</orderId>
        <planCode>P272018JTJJ000501</planCode>
        <policySort>0</policySort>
        <policyType>1</policyType>
        <riskCode>2701</riskCode>
        <sumAmount>719000</sumAmount>
        <sumPremium>6.00</sumPremium>
        <planFeeInfo>
          <currency>CNY</currency>
          <delinquentFee>6.00</delinquentFee>
          <payNo>1</payNo>
          <payReason>R10</payReason>
          <planFee>6.00</planFee>
          <serialNo>1</serialNo>
        </planFeeInfo>
        <sumQuantity>1</sumQuantity>
        <proposalAppliInfo>
          <identifyNumber>222401199306014520</identifyNumber>
          <identifyType>01</identifyType>
          <insuredName>金庆玲</insuredName>
          <phoneNumber>13269206880</phoneNumber>
          <birthDate>1993-06-01</birthDate>
          <postAddress>通信地址123</postAddress>
          <identifyDate>2020-06-01</identifyDate>
          <insuredNature>3</insuredNature>
          <insuredAddress/>
          <insuredIdentity/>
          <sex>2</sex>
          <mobile/>
          <email>wei.liu@hi-ins.com.cn</email>
          <postCode/>
          <bank/>
          <account/>
          <linkerName/>
          <nationalityCode/>
        </proposalAppliInfo>
        <proposalInsuredInfoList>
          <age>1</age>
          <birthDate>1991-06-01</birthDate>
          <identifyNumber>222401199306014520</identifyNumber>
          <identifyType>01</identifyType>
          <insuredFlag>1</insuredFlag>
          <insuredIdentity>01</insuredIdentity>
          <insuredName>金庆玲</insuredName>
          <insuredNature>3</insuredNature>
          <phoneNumber/>
          <serialNo>0</serialNo>
          <sex>2</sex>
          <relateSerialNo>0</relateSerialNo>
          <mobile/>
          <email/>
          <postAddress/>
          <postCode/>
          <bank/>
          <account/>
          <linkerName/>
          <nationalityCode/>
          <benefitFlag/>
          <benefitRate>100</benefitRate>
          <occupationCode/>
          <insuredAddress/>
        </proposalInsuredInfoList>
        <requestInfo>
          <password>c64fe1a8</password>
          <user>jiangtai</user>
          <transcationCode>JTJJ-xiandai20180110153001</transcationCode>
        </requestInfo>
        <riskInfoList>
			<amount>100000</amount>
			<kindCode>2701C01</kindCode>
			<premium>0</premium>
		</riskInfoList>
		<riskInfoList>
			<amount>50000</amount>
			<kindCode>2701F26</kindCode>
			<premium>0</premium>
		</riskInfoList>
		<riskInfoList>
			<amount>20000</amount>
			<kindCode>2701F27</kindCode>
			<premium>0</premium>
		</riskInfoList>
		<riskInfoList>
			<amount>20000</amount>
			<kindCode>2701F28</kindCode>
			<premium>0</premium>
		</riskInfoList>
		<riskInfoList>
			<amount>9000</amount>
			<kindCode>2701F29</kindCode>
			<premium>0</premium>
		</riskInfoList>
		<riskInfoList>
			<amount>300000</amount>
			<kindCode>2701F03</kindCode>
			<premium>0</premium>
		</riskInfoList>
		<riskInfoList>
			<amount>200000</amount>
			<kindCode>2701F04</kindCode>
			<premium>0</premium>
		</riskInfoList>
		<riskInfoList>
			<amount>20000</amount>
			<kindCode>2701F16</kindCode>
			<premium>0</premium>
		</riskInfoList>
	   <travelInfo>
          <destinationArea>泰国</destinationArea>
        </travelInfo>
        <productCode>P272018JTJJ0005</productCode>
         </CommonAccidentProposalInfo>
      </ser:proposalPrepare>
   </soapenv:Body>
</soapenv:Envelope>